&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьПоляОплаты();

КонецПроцедуры


&НаКлиенте
Процедура СпособОплатыПриИзменении(Элемент)

	ОбновитьПоляОплаты();

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьПоляОплаты()

	Если Элементы.Найти("Касса") = Неопределено
		Или Элементы.Найти("БанковскийСчет") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.СпособОплаты) Тогда
		Элементы.Касса.Видимость = Ложь;
		Элементы.БанковскийСчет.Видимость = Ложь;
		Возврат;
	КонецЕсли;

	Если Объект.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособОплаты.Наличная") Тогда
		
		Элементы.Касса.Видимость = Истина;
		Элементы.БанковскийСчет.Видимость = Ложь;
		Объект.БанковскийСчет = Неопределено;
		
	ИначеЕсли Объект.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособОплаты.Безналичная")
		Или Объект.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособОплаты.Онлайн") Тогда
		
		Элементы.Касса.Видимость = Ложь;
		Элементы.БанковскийСчет.Видимость = Истина;
		Объект.Касса = Неопределено;
		
	Иначе
		
		Элементы.Касса.Видимость = Ложь;
		Элементы.БанковскийСчет.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры